#+title: Notes (Development)
#+author: Marcus Birkenkrahe
#+subtitle: CSC 100
#+SEQ_TODO: PRACTICE | DONE
#+STARTUP: overview hideblocks indent entitiespretty
#+OPTIONS: toc:1 num:1 ^:nil
#+PROPERTY: :header-args:C       :main yes :includes <stdio.h> <stdlib.h> <time.h> :noweb yes :results output :exports both
#+PROPERTY: :header-args:python  :session *Python* :python python3 :results output :exports both
#+PROPERTY: :header-args:R       :session *R* :results graphics output file :exports both
#+PROPERTY: :header-args:C++     :main yes :includes <iostream> :results output :exports both
* IN PROGRESS Workload computation

- Different versions:
  1) All in one file including initialization.
  2) All in one file but initialized from command-line.
  3) Modularized using functions, initialized from command-line.

- Version 1: All in one file
#+begin_src C :results output
  // declare and define variables given: no of weeks, classes,
  // assignments, tests, class length
  int number_of_weeks = 16,
    classes_per_week = 3,
    number_of_coding_assignments = 14,
    number_of_tests = 14;
  float hrs_per_class = 1.f;

  // variables estimated: hrs per test and assignment
  float hrs_per_test = 1.f;
  float hrs_per_coding_assignment = 2.f;

  // computed:
  float hrs_in_class,
    hrs_test,
    hrs_coding_assignment,    
    hrs_per_week,
    hrs_total;

  // compute results
  hrs_in_class =
    number_of_weeks * classes_per_week * hrs_per_class;
  hrs_test =
    number_of_tests * hrs_per_test;
  hrs_coding_assignment =
    number_of_coding_assignments * hrs_per_coding_assignment;
  hrs_total =
    hrs_in_class +
    hrs_coding_assignment +
    hrs_test;
  // print results
  printf("Time in class: %g hrs.\n", hrs_in_class);
  printf("Time outside of class: %g hrs.\n",
         hrs_total - hrs_in_class);
  printf("Time for tests [%g hrs/test]: %g hrs.\n",hrs_per_test,hrs_test);
  printf("Time for coding assignments [%g hrs/pgm]: %g hrs.\n",hrs_per_coding_assignment,hrs_coding_assignment);
    printf("Total number of hrs in term: %g.\n", hrs_total);
  printf("Weekly workload (outside of class): %g (%g)\n",
         hrs_total/number_of_weeks, (hrs_total-hrs_in_class)/number_of_weeks);
#+end_src

#+RESULTS:
: Time in class: 48 hrs.
: Time outside of class: 42 hrs.
: Time for tests [1 hrs/test]: 14 hrs.
: Time for coding assignments [2 hrs/pgm]: 28 hrs.
: Total number of hrs in term: 90.
: Weekly workload (outside of class): 5.625 (2.625)

* NOT ~!~ question by Nichole

#+begin_quote
Does the operator ! convert the value of the operand to a binary value
and then act to reverse that value?
#+end_quote
​Yes, very good observation. Reverse = inverse.

#+begin_quote
If x=5, ! causes the machine to see the five as TRUE and returns the
 reverse of that, so !x will return FALSE because what the machine
 sees is NOT TRUE, i.e. !1?
#+end_quote

In C, all values except =0= are considered =TRUE= by the machine.
#+begin_src C :results output
  float truth[]={0,1,-100,3.14};

  for (int i=0; i<4;i++) {
    if(truth[i])
      printf("%g is TRUE\n",truth[i]);
    else 
      printf("%g is FALSE\n",truth[i]);
   }
#+end_src

#+RESULTS:
: 0 is FALSE
: 1 is TRUE
: -100 is TRUE
: 3.14 is TRUE

For your example: the =stdbool= header file allows you to define a data
type =bool= but C still only uses 1 and 0 internally for TRUE and FALSE.
#+begin_src C
  #include <stdbool.h>
  bool x = 5;
  printf("%d %d",x, !x); // 5 is TRUE and !5 = 0 is FALSE
#+end_src

#+RESULTS:
: 1 0

#+begin_quote
And if x=0, ! causes the machine to see the zero as FALSE so the
machine will return TRUE because what it sees is NOT FALSE, i.e. !0?
#+end_quote

#+begin_src C
  #include <stdbool.h>
  bool x = 0;
  printf("%d %d",x, !x); // 5 is TRUE and !5 = 0 is FALSE
#+end_src

#+RESULTS:
: 0 1

